* coordinates of each footprint
|                 |     left_x |    left_y |    delta_x |   delta_y |   right_x |   right_y |  angle |
|-----------------+------------+-----------+------------+-----------+-----------+-----------+--------|
| reference point |        212 |     43.75 |          0 |        0. | 82.754568 |     46.11 |        |
| pro micro       |        201 |    60.175 |        -11 |    16.425 | 93.754568 |    62.535 |        |
| display         |        201 |    79.275 |        -11 |    35.525 | 93.754568 |    81.635 |        |
| encoder         | 199.321127 | 93.163087 | -12.678873 | 49.413087 | 95.433441 | 95.523087 |    -95 |
| power_switch    |      209.7 |      96.9 |       -2.3 |     53.15 | 85.054568 |     99.26 | -103.4 |
| reset_button    |    211.825 |     86.45 |     -0.175 |      42.7 | 82.929568 |     88.81 |    -95 |
| sw1             |        107 |        67 |       -105 |     23.25 | 187.75457 |     69.36 |        |
| sw2             |        125 |        55 |        -87 |     11.25 | 169.75457 |     57.36 |        |
| sw3             |        143 |        48 |        -69 |      4.25 | 151.75457 |     50.36 |        |
| sw4             |        161 |      53.5 |        -51 |      9.75 | 133.75457 |     55.86 |        |
| sw5             |        179 |        56 |        -33 |     12.25 | 115.75457 |     58.36 |        |
| sw6             |        107 |        84 |       -105 |     40.25 | 187.75457 |     86.36 |        |
| sw7             |        125 |        72 |        -87 |     28.25 | 169.75457 |     74.36 |        |
| sw8             |        143 |        65 |        -69 |     21.25 | 151.75457 |     67.36 |        |
| sw9             |        161 |      70.5 |        -51 |     26.75 | 133.75457 |     72.86 |        |
| sw10            |        179 |        73 |        -33 |     29.25 | 115.75457 |     75.36 |        |
| sw11            |        107 |       101 |       -105 |     57.25 | 187.75457 |    103.36 |        |
| sw12            |        125 |        89 |        -87 |     45.25 | 169.75457 |     91.36 |        |
| sw13            |        143 |        82 |        -69 |     38.25 | 151.75457 |     84.36 |        |
| sw14            |        161 |      87.5 |        -51 |     43.75 | 133.75457 |     89.86 |        |
| sw15            |        179 |        90 |        -33 |     46.25 | 115.75457 |     92.36 |        |
| sw16            | 176.407158 |    110.95 | -35.592842 |      67.2 | 118.34741 |    113.31 |     -5 |
| sw17            | 195.367403 |    114.55 | -16.632597 |      70.8 | 99.387165 |    116.91 |    -13 |
| h1              |        115 |      57.5 |        -97 |     13.75 | 179.75457 |     59.86 |        |
| h2              |      171.2 |    46.425 |      -40.8 |     2.675 | 123.55457 |    48.785 |        |
| h3              |      187.3 |     101.6 |      -24.7 |     57.85 | 107.45457 |    103.96 |        |
| h4              |     116.95 |    108.15 |     -95.05 |      64.4 | 177.80457 |    110.51 |        |
| h5              |     165.35 |    114.93 |     -46.65 |     71.18 | 129.40457 |    117.29 |        |
| battery_switch  |      209.7 |      96.9 |       -2.3 |     53.15 | 85.054568 |     99.26 |    -103.4  |
| battery_con     |        167 |        99 |        -45 |     55.25 | 127.75457 |    101.36 |    130 |
| coil_con        |     155.85 |    98.025 |     -56.15 |    54.275 | 138.90457 |   100.385 | -98    |
| pogopin-1       |     202.54 |        53 |      -9.46 |      9.25 | 92.214568 |     55.36 |        |
| pogopin-2       |        200 |        53 |        -12 |      9.25 | 94.754568 |     55.36 |        |
| pogopin-3       |    178.625 |    100.35 |    -33.375 |      56.6 | 116.12957 |    102.71 |        |
#+TBLFM: $4=$2-@2$2::$5=$3-@2$3::$6=-$4+82.754568::$7=$5+46.11
